# 11)კომენტარის სახით ჩამოწერეთ ის სამი ტექნიკა რასაც კომპიუტერი იყენებს პრობლემების გადასაჭრელად კოდში,თითეულს მიუწერე თავიანთ ახსნა განმარტება გვერდით

#1. Sequence (სერიული შესრულება):
#კომპიუტერი ასრულებს კოდს ზუსტად ისე, როგორც ის არის დაწერილი, ერთი ხაზიდან მეორეზე გადადის ზედმეტი გადახვევების გარეშე. ეს ტექნიკა უზრუნველყოფს, რომ ინსტრუქციები შესრულდეს თანმიმდევრულად და ლოგიკურად.

#2. Selection (შერჩევა):
#ეს ტექნიკა საშუალებას აძლევს კომპიუტერს მიიღოს გადაწყვეტილებები კოდის შესრულების დროს, გამოყენებით if, else და switch სტრუქტურებს. კომპიუტერი ირჩევს სხვადასხვა გზებს კოდის შესრულებისთვის, დამოკიდებულია მოცემულ პირობებზე.

#3. Iteration (მეორედ შესრულება):
#კომპიუტერი იყენებს ციკლებს (for, while) იმისთვის, რომ განმეორებით შეასრულოს კოდის ნაწილი, სანამ გარკვეული პირობა შესრულდება. ეს ტექნიკა ეფექტურია, როდესაც საჭიროა ერთნაირი ოპერაციების შესრულება მრავალჯერ.