#1) მომხმარებელს შემოატანინე ტემპერატურა (რიცხვი) და შემდეგ შეამოწმე:
#თუ ტემპერატურა მეტია 30-ზე -> დაბეჭდე "ძალიან ცხელა!"
#თუ ტემპერატურა მეტია 10-ზე -> დაბეჭდე "ცოტა ცივა"
#თუ ტემპერატურა მეტია 0-ზე -> დაბეჭდე "ცივა, ჩაიცვი თბილად"
#სხვა შემთხვევაში -> "გაიყინები, სახლში დარჩი!"


temperature=float(input("შეიყვანეთ ტემპერატურა: "))
if temperature>=30:
    print("ძალიან ცხელა!")
elif temperature>10:
    print("ცოტა ცივა")
elif temperature>0:
    print("ცივა, ჩაიცვი თბილად")
else:
    print("გაიყინები, სახლში დარჩი!")