#2) მომხმარებელს შემოატანინე ორი რიცხვი:
#--> ქულა (score)
#--> დასწრება (attendance პროცენტებში)
#შემდეგ შეამოწმე:
#თუ ქულა მეტია 80-ზე და დასწრება მეტია 90-ზე -> "შენ შესანიშნავად დაწერე გამოცდა"
#თუ ქულა მეტია 50-ზე და დასწრება მეტია 70-ზე -> "საშუალოდ დაწერე გამოცდა"
#თუ ქულა მეტია 30-ზე ან დასწრება მეტია 50-ზე -> "გაჭირვებით, მაგრამ ჩააბარე გამოცდა"
#ყველა სხვა შემთხვევაში → "ჩაიჭერი!"


score=int(input("შეიყვანეთ თქვენი ქულა: "))
attendance=int(input("შეიყვანეთ თქვენი დასწრება პროცენტებში (0-100): "))

if attendance>100 or attendance<0:
    print("დასწრება პროცენტებში უნდა იყოს 0-100 შორის!")
elif score>80 and attendance>90:
    print("შენ შესანიშნავად დაწერე გამოცდა")
elif score>50 and attendance>70:
    print("საშუალოდ დაწერე გამოცდა")
elif score>30 or attendance>50:
    print("გაჭირვებით, მაგრამ ჩააბარე გამოცდა")
else:
    print("ჩაიჭერი!")