# 1)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებთ რაიმე რიცხვს

# შექმენი მეორე ცვლადი სადაც მომხმარებელს შემოატანინებთ რაიმე სახელს

# შეამოწმე-->

# თუ შემოყვანილი ასაკი მეტოა 60 ზე მაშინ შეამოწმე შიგნით -->
    # თუ შემოყვანილი სახელი არის --> "kote"  მაშინ დაუპრინტე --> შენი სახელია კოტე და ხარ მოხუცი
    # სხვა შემთხვევაში დაუპრინტე --> შენი სახელი არ არის კოტე მაგრამ ხარ მოხუცი

# თუ ასაკი ნაკლებია 60 ზე მაშინ შეამოწმე შიგნით -->
    # თუ შემოყვანილი სახელი --> "kote" მაშინ დაუპრინტე --> შენი სახელი არის კოტე მაგრამ შენ ხარ ახალგაზრდა:
    # სხვა შემთხვევაში დაუპრინტე --> შენი სახელი არ არის კოტე მაგრამ ხალ ახალგაზრდა


age=int(input('Enter your age:'))
name=input('Enter your name:')

if age>60:
    if name=='kote':
        print('შენი სახელია კოტე და ხარ მოხუცი')
    else:
        print('შენი სახელი არ არის კოტე მაგრამ ხარ მოხუცი')

else:
    if name=='kote':
        print('შენი სახელი არის კოტე მაგრამ შენ ხარ ახალგაზრდა')
    else:
        print('შენი სახელი არ არის კოტე მაგრამ ხალ ახალგაზრდა')