# 12)
# შექმენი სია სახელად --> first_five_numbers და ამ სიაში შეინახე ინტეჯერი რიცხვები 1 დან 5 ჩათვლით

# შექმენი მეორე სია სახელად --> second_five_numbers და ამ ცვლადში შეინახე ინტეჯერი რიცხვები 6 დან 10 ჩათვლით

# შექმენი ცვლადი სახელად --> all_numbers სადაც შეინახავ წინა ორ სიაში შენახულ რიცხვებს,გამოიყენე ცვლადის სახელები რომ მესამე სიაში გადმოიტანოთ წინა ორი სია

# საბოლოოდ დაპრინტე საბოლოო სია სადაც ორი სია გაქვთ მოთავსებული და ნახეთ შედეგი


first_five_numbers = [1, 2, 3, 4, 5]
second_five_numbers = [6, 7, 8, 9, 10]
all_numbers = first_five_numbers + second_five_numbers
print(all_numbers)