# 6)კომენტარის სახით ახსენით თუ რა არის სია და რაშივიყენებთ მას,ასევე ახსენი თუ რით განსხვავდება იგი ცვლადისგან


# სია არის მონაცემთა სტრუქტურა, რომელიც გამოიყენება ერთზე მეტ მნიშვნელობას ერთ ცვლადში შენახვისთვის.
# სია საშუალებას გვაძლევს შევინახოთ და მოვაწყოთ მონაცემები ერთიან ფორმატში, რაც საშუალებას გვაძლევს მარტივად მივწვდეთ და შევცვალოთ მონაცემები.
# სია განსხვავდება ცვლადისგან იმით, რომ ცვლადი ჩვეულებრივ გამოიყენება ერთი მნიშვნელობის შესანახად, ხოლო სია გამოიყენება მრავალ მნიშვნელობათა კოლექციის შესანახად.
# სიის ელემენტებს შეუძლიათ განსხვავებული ტიპები ჰქონდეთ, და სია შეიძლება შეიცავდეს დუბლირებულ მნიშვნელობებსაც.