# 6)მომხმარებელს შემოატანინე რაიმე სტრინგი,შენი დავალებაა დაითვალო თუ რამდენი ცალი ხმოვანი და რამდენი ცალი თანხმოვანი გვხვდება მის მიერ შემოყვანილ სტრინგში


letters=input('შეიყვანე რაიმე ასო (stop გასაჩერებლად :D ): ')
ხმოვნები='აეიოუ'
ხმოვნების_რაოდენობა=0
თანხმოვნების_რაოდენობა=0
while letters!='stop':
    for letter in range(len(letters)):
        if letters[letter] in ხმოვნები:
            ხმოვნების_რაოდენობა=ხმოვნების_რაოდენობა+1
            letters=input('შეიყვანე რაიმე ასო (stop გასაჩერებლად :D ): ')
        else:
            თანხმოვნების_რაოდენობა=თანხმოვნების_რაოდენობა+1
            letters=input('შეიყვანე რაიმე ასო (stop გასაჩერებლად :D ): ')
print("ხმოვნების რაოდენობა არის:",ხმოვნების_რაოდენობა)
print("თანხმოვნების რაოდენობა არის:",თანხმოვნების_რაოდენობა)